tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "ffmpeg"

# Network
brew "tcptraceroute"
# IP/CIDR Calculation tool
brew "ipcalc"

# Load Testing
brew "k6"

# Cloud
brew "azure-cli"
brew "awscli"
cask "google-cloud-sdk"
brew "azcopy"
cask "microsoft-azure-storage-explorer"
cask "microsoft-remote-desktop"

# IaC
brew "tenv" # Replaces tfenv and tofuenv
brew "terraform-docs"
brew "tflint"
brew "cloudflare/cloudflare/cf-terraforming"
brew "infracost"
#brew "pulumi"
cask "vagrant"
cask "vagrant-vmware-utility"
brew "ansible-lint"

# Development
brew "gh"
brew "act"
brew "git-secrets"
brew "gitleaks"
cask "devtoys"
cask "fork"
brew "lazygit"
cask "rider"
brew "neovim"
brew "go"

## Frontend
brew "volta"

## Databases
brew "pgcli"
cask "datagrip"
cask "redisinsight"

# Virtualization
brew "qemu"
#brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
# Enable metrics server on Orbstack
# k apply -f https://github.com/kubernetes-sigs/metrics-server/releases/download/v0.7.1/components.yaml
cask "orbstack"

# k8s
brew "kubernetes-cli"
# kubectx is a tool to switch between contexts (clusters) on kubectl faster.
# kubens is a tool to switch between Kubernetes namespaces (and configure them for kubectl) easily.
brew "kubectx"
brew "k9s"
brew "helm"
brew "helmfile"

# Teams
cask "slack"

# OS Personalization
cask "rectangle"
cask "alt-tab"
cask "flameshot"
cask "hiddenbar"
cask "logi-options-plus"
cask "logitune"
cask "maccy"
cask "raycast"
cask "spotify"
cask "stats"

## Others
cask "whatsapp"
brew "cowsay"

# Terminal
cask "iterm2"
cask "warp"
cask "alacritty"
cask "kitty"

## Multiplexor
brew "tmux"

## Propmt
brew "starship"

## Others
brew "jq"
brew "bat"
brew "lsd"
brew "fzf"
brew "htop"
brew "yazi"
brew "watch"
brew "gnupg"
brew "zoxide"
brew "neofetch"
#brew "zsh-autosuggestions"
#brew "zsh-completions"
#brew "zsh-syntax-highlighting"
cask "powershell"
brew "ripgrep"
brew "yamllint"
brew "mtr"

# Cracking
#brew "john-jumbo"
#brew "hashcat"

# Python
brew "pyenv-virtualenv"
brew "pipx"

# Encryption
brew "age"
brew "sops"

# VPN Services
cask "perimeter81"
cask "tailscale"
brew "tailscale", link: false

# Note taking
cask "obsidian"
brew "hugo"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"

# VS Code
vscode "drcika.apc-extension"
vscode "oderwat.indent-rainbow"
vscode "kestra-io.kestra"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "4ops.terraform"
vscode "foxundermoon.shell-format"
vscode "ahmadalli.vscode-nginx-conf"
vscode "almenon.arepl"
vscode "astro-build.astro-vscode"
vscode "azure-automation.vscode-azureautomation"
vscode "bartolomesintes.mclibre-org-html-css-extension-pack"
vscode "batisteo.vscode-django"
vscode "bradgashler.htmltagwrap"
vscode "compilenix.vscode-zonefile"
vscode "compulim.compulim-vscode-closetag"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
#vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
#vscode "marcostazi.VS-code-vagrantfile"
vscode "htmlhint.vscode-htmlhint"
vscode "ionutvmi.reg"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "l7ssha.tag-inserter"
vscode "magicstack.magicpython"
vscode "mkaufman.htmlhint"
vscode "mrmlnc.vscode-csscomb"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
#vscode "mycelo.oracle-plsql"
#vscode "oracle.oracledevtools"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "njpwerner.autodocstring"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "miguelsolorio.fluent-icons"
vscode "wholroyd.jinja"
vscode "ybaumes.highlight-trailing-white-spaces"
vscode "redhat.ansible"